Repository: tianpingdeng112233-cell/meetpr
Catalog: Modules/ChatUI/Sources/ChatUI/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# chat.addAttachment
source: 添加附件
en: Add attachment

# chat.addVideoMarker
source: ＋ 打点
en: ＋ Add marker

# chat.back
source: 返回
en: Back

# chat.choosePhoto
source: 选择图片
en: Choose photo

# chat.cancel
source: 取消
en: Cancel

# chat.close
source: 关闭
en: Close

# chat.closeAnnotation
source: 关闭标注
en: Close annotation

# chat.closePlayback
source: 关闭播放
en: Close playback

# chat.completedSection
source: 已完成
en: Completed

# chat.composerPlaceholder
source: 输入消息
en: Message

# chat.continueSelection
source: 继续
en: Continue

# chat.continueToChat
source: 去聊天补充一句话
en: Continue to chat and add a message

# chat.delivered
source: 已送达
en: Delivered

# chat.demo.coach
source: 周教练
en: Coach Zhou

# chat.demo.coachMessage
source: 明天深蹲加到 140。
en: Take tomorrow's squat to 140.

# chat.demo.firstStudent
source: 王晨曦
en: Chenxi Wang

# chat.demo.secondStudent
source: 李嘉宁
en: Jianing Li

# chat.demo.studentMessage
source: 教练，今天最后一组完成了。
en: Coach, I finished today's last set.

# chat.demo.studentReply
source: 收到。
en: Got it.

# chat.image
source: [图片]
en: [Image]

# chat.imagePreparationFailed
source: 图片处理失败
en: Could not process image

# chat.imageUnavailable
source: 图片暂不可用
en: Image unavailable

# chat.includeVideo
source: 一并发送这组视频
en: Include this set's video

# chat.invalidSetRecord
source: 这组记录暂时无法分享
en: This set cannot be shared right now

# chat.load
source: 重量 × 次数
en: Weight × reps

# chat.loadOlder
source: 加载更早消息
en: Load earlier messages

# chat.loadMessagesFailed
source: 消息加载失败
en: Could not load messages

# chat.loadingMessages
source: 正在加载消息…
en: Loading messages…

# chat.loggedSetCardLabel
source: 我记录的一组
en: A set I logged

# chat.messageTooLong
source: 训练记录和备注合计不能超过 4000 个字符，请缩短备注
en: The training record and note cannot exceed 4,000 characters. Shorten the note.

# chat.messages
source: 消息
en: Messages

# chat.noConversations
source: 暂无会话
en: No conversations yet

# chat.noMessages
source: 还没有消息
en: No messages yet

# chat.noMessagesDescription
source: 开始对话吧
en: Start the conversation

# chat.noShareableSets
source: 今天没有可分享的训练组
en: No training sets to share today

# chat.noShareableSetsDescription
source: 今天的计划组或已记录组会显示在这里
en: Today's planned or logged sets will appear here

# chat.pausePlayback
source: 暂停
en: Pause

# chat.plannedSetCardLabel
source: 我今天的计划
en: My plan for today

# chat.playPlayback
source: 播放
en: Play

# chat.playVideo
source: 播放视频
en: Play video

# chat.playbackFailed
source: 播放失败，链接可能已过期
en: Playback failed. The link may have expired.

# chat.playbackProgress
source: 播放进度
en: Playback progress

# chat.playbackSpeed
source: 播放速度
en: Playback speed

# chat.preparingImage
source: 正在处理图片
en: Processing image

# chat.read
source: 已读
en: Read

# chat.refreshing
source: 刷新中…
en: Refreshing…

# chat.relative.dayAgo
source: 1 天前
en: 1 day ago

# chat.relative.daysAgo %@
source: %@ 天前
en: %@ days ago

# chat.relative.hourAgo
source: 1 小时前
en: 1 hour ago

# chat.relative.hoursAgo %@
source: %@ 小时前
en: %@ hours ago

# chat.relative.justNow
source: 刚刚
en: Just now

# chat.relative.minuteAgo
source: 1 分钟前
en: 1 minute ago

# chat.relative.minutesAgo %@
source: %@ 分钟前
en: %@ minutes ago

# chat.relative.monthAgo
source: 1 个月前
en: 1 month ago

# chat.relative.monthsAgo %@
source: %@ 个月前
en: %@ months ago

# chat.relative.yearAgo
source: 1 年前
en: 1 year ago

# chat.relative.yearsAgo %@
source: %@ 年前
en: %@ years ago

# chat.removeTrainingShare
source: 移除训练分享
en: Remove training share

# chat.retry
source: 重试
en: Retry

# chat.seekToVideoMarker
source: 跳转到 {time}
en: Jump to {time}

# chat.selected
source: 已选择
en: Selected

# chat.send
source: 发送
en: Send

# chat.sendCurrentSetPlan
source: 发送这组当前的计划
en: Send the current plan for this set

# chat.sendCurrentSetRecord
source: 发送这组当前的记录
en: Send the current log for this set

# chat.sendFailed
source: 发送失败
en: Failed to send

# chat.sending
source: 发送中
en: Sending

# chat.setCardDelivered
source: ✓ 已送达 · 等教练看
en: ✓ Delivered · Waiting for coach

# chat.setCardRead
source: ✓ 教练已读
en: ✓ Read by coach

# chat.setNumber
source: 组次
en: Set

# chat.setPosition %@
source: 第%@组
en: Set %@

# chat.setPosition %@ of %@
source: 第%@组/%@
en: Set %@ of %@

# chat.setRefNotePlaceholder
source: 补一句话（可选）
en: Add a message (optional)

# chat.setReference.loggedTag
source: [训练分享]
en: [Training share]

# chat.setReference.plannedMarker
source: 计划
en: planned

# chat.setReference.plannedTag
source: [训练计划]
en: [Training plan]

# chat.shareTodayTraining
source: 分享今日训练
en: Share today's training

# chat.todayPlanSection
source: 今日计划
en: Today's plan

# chat.trainingLoadFailed
source: 今日训练记录加载失败，请重试
en: Could not load today's training. Try again.

# chat.trainingShare
source: 训练分享
en: Training share

# chat.trainingShareFailed
source: 这组记录暂时无法发送
en: This set cannot be sent right now

# chat.unread
source: 条未读
en: unread

# chat.videoBadge.coach %@
source: 教练：%@
en: Coach: %@

# chat.videoBadge.collapse
source: 收起训练角标
en: Collapse training badge

# chat.videoBadge.expand
source: 展开训练角标
en: Expand training badge

# chat.videoBadge.setPrefix
source: 第
en: Set

# chat.videoExport.action
source: 导出
en: Export

# chat.videoExport.coachConfirmation.action
source: 确认并导出
en: Confirm and export

# chat.videoExport.coachConfirmation.message
source: 对外发布前请确认已获学员同意
en: Before publishing externally, confirm that you have the student's consent.

# chat.videoExport.coachConfirmation.title
source: 导出学员视频
en: Export student video

# chat.videoExport.exporting
source: 正在导出视频
en: Exporting video

# chat.videoExport.failed
source: 导出失败
en: Export failed

# chat.videoExport.failureMessage
source: 未能生成带角标的视频，请重试
en: MeetPR could not create this badged video. Please try again.

# chat.videoExport.photoPermissionDenied
source: 请允许 MeetPR 向相册添加视频后重试
en: Allow MeetPR to add videos to Photos, then try again.

# chat.videoExport.saved
source: 已存入相册
en: Saved to Photos

# chat.videoFailed
source: 视频上传失败，请先在训练页重试
en: Video upload failed. Retry from the training screen first.

# chat.videoMarker
source: 视频打点
en: Video marker

# chat.videoMarkers
source: 打点 · {count}
en: Markers · {count}

# chat.videoMarkersFailed
source: 打点加载失败
en: Could not load markers

# chat.videoPlayback
source: 视频回放 //
en: VIDEO PLAYBACK //

# chat.videoReady
source: 视频已就绪
en: Video ready

# chat.videoUnavailable
source: 这段视频已不可用，请取消勾选后继续
en: This video is no longer available. Deselect it to continue.

# chat.videoUploading
source: 视频上传中，仍可继续发送
en: Video is uploading. You can still send the message.
